{
    "Development Tools": {
        "Jenkins": [
            "Leaving the delimiter 'anonymous' set to 'authenticated' for matrix-based security",
            "Not setting up administrative monitoring",
            "Using default admin credentials",
            "Not updating plugins to the latest versions",
            "Using outdated core Jenkins version",
            "Not configuring or disabling the JNLP (Java Network Launch Protocol) agent protocol",
            "Allowing public read access to Jenkins jobs and configurations",
            "Not configuring proper backup and restore settings",
            "Insufficient disk space management leading to performance issues",
            "Not setting up secure credential management",
            "Exposing Jenkins master to the network without proper security",
            "Not securing the Jenkins CLI",
            "Improper use of Script Security Plugin",
            "Lack of role-based access control"
        ],
        "Jupyter Lab": [
            "No password protection on the instance",
            "Running as a root user",
            "No SSL/TLS configured for secure communication",
            "Exposing the application to public access",
            "No automatic token generation for sessions",
            "Insecure file permissions on configuration files",
            "Disabling or not configuring Content Security Policy (CSP)",
            "Not restricting resource usage, allowing DoS attacks",
            "No logging or auditing of user activities",
            "Failure to update to the latest version, missing security patches"
        ],
        "Jupyter Notebook": [
            "Lack of password authentication or token authentication",
            "Allowing root access to the container running the notebook",
            "Exposing the notebook server to the public internet without proper network segmentation",
            "Running the Jupyter Notebook server as a privileged user",
            "Not using HTTPS to secure data in transit",
            "Storing authentication credentials directly in the notebook",
            "Using default ports and ports easily discoverable for the service",
            "Not regularly updating the Jupyter Notebook and its dependencies",
            "Insecure file permissions allowing unauthorized access to notebook files",
            "Enabling unnecessary services or extensions that may introduce vulnerabilities"
        ],
        "Laravel": [
            "Environment variables exposed in .env file",
            "Debug mode enabled in production",
            "Insecure default configuration for database connections",
            "Insufficient validation on user inputs",
            "Improper use of facades leading to tight coupling",
            "Directly exposing sensitive files like .env or composer.json",
            "Lack of proper authentication and authorization",
            "Improper handling of CSRF tokens",
            "Allowing the storage of sensitive data without encryption",
            "Insecure third-party packages without proper validation",
            "Improper error handling revealing stack traces",
            "Directory listing enabled in the web server configuration",
            "Not using HTTPS for secure communication",
            "Incorrect file permissions on Laravel storage and cache directories"
        ],
        "Selenium Grid": [
            "Improperly configured browser nodes leading to version mismatches",
            "Lack of proper resource allocation causing overutilization of nodes",
            "No security authentication setup for accessing the Grid",
            "Exposing Grid and Node management ports to the internet",
            "Improper logging configuration that omits important events",
            "Not setting up proper shutdown hooks for nodes leading to unclean terminations",
            "Ignoring network segmentation best practices for enhanced security",
            "Not configuring SSL/TLS for secure communication between Hub and Nodes",
            "Using default configurations without reviewing the security implications",
            "Inadequate handling of browser instances, permitting unauthorized access"
        ],
        "SonarQube": [
            "Default administrator credentials not changed",
            "Lack of SSL/TLS configuration for secure communication",
            "Improper access control settings",
            "Outdated plugins with known vulnerabilities",
            "Insufficient logging and monitoring configurations",
            "Lack of automated backups",
            "Deployment in public subnet without proper security groups",
            "Inadequate input validation for custom plugins"
        ]
    },
    "Messaging Systems": {
        "Apache ActiveMQ": [
            "No authentication for web console access",
            "No encryption for data in transit (lack of SSL/TLS)",
            "Default credentials left unchanged",
            "No access control or authorization for queues and topics",
            "Broker jmx not secured",
            "Exposed administrative interfaces",
            "Lack of audit logging and monitoring",
            "Excessive permissions for ActiveMQ user",
            "Insecure configuration of network connectors",
            "Unrestricted file access permissions",
            "Inadequate isolation between brokers and other applications"
        ],
        "Apache Kafka": [
            "Insecure default configurations not changed (e.g., no authentication or authorization)",
            "Unrestricted access to ZooKeeper ensemble",
            "Not encrypting data in transit (no SSL/TLS)",
            "Inappropriate permission settings on Kafka topics",
            "Insufficient logging and monitoring",
            "Misconfigured broker settings leading to resource exhaustion",
            "Insecure configurations of Kafka Connect and Kafka Streams",
            "Improperly managed Kafka user credentials",
            "Kafka brokers exposing sensitive information due to misconfigured logging levels"
        ],
        "RabbitMQ": [
            "Default credentials not changed",
            "No SSL/TLS for communication encryption",
            "Management plugin exposed on default port",
            "Unauthorized access to the management console",
            "Default virtual host and user not removed",
            "Peer verification disabled",
            "Inadequate logging and monitoring",
            "Improperly secured configuration files",
            "Open access to RabbitMQ ports",
            "Lack of resource quotas leading to DoS attacks"
        ]
    },
    "Data Processing": {
        "Apache Airflow": [
            "Default credentials not changed",
            "Weak or no encryption for sensitive data",
            "Overly permissive DAG permissions",
            "Unsecured access to the web UI",
            "Inadequate use of role-based access control",
            "Misconfigured logging settings",
            "Insecure database connections",
            "Inappropriate use of Airflow variables for sensitive information",
            "Lack of network segmentation for Airflow components",
            "Outdated Airflow version with known vulnerabilities"
        ],
        "Apache NiFi": [
            "Default username and password are not changed",
            "Sensitive properties are not encrypted",
            "Lack of proper access control configurations",
            "Running NiFi as a root user",
            "Unrestricted access to the NiFi UI",
            "No SSL/TLS encryption for communication",
            "Not configuring appropriate resource limits",
            "Lack of network segmentation and isolation",
            "Insufficient logging and monitoring",
            "Using default values for sensitive configurations"
        ],
        "Apache Flink": [
            "Insufficient authentication and authorization controls",
            "Open JMX/RPC ports without proper firewalls",
            "Insecure default settings for jobmanager and taskmanager roles",
            "Lack of encryption for data in transit",
            "Debug mode enabled in production environments",
            "Inadequate logging and monitoring configurations",
            "Excessive permissions for Flink service accounts",
            "Default passwords unchanged",
            "Improperly configured memory and resource allocations"
        ],
        "Apache Hadoop": [
            "Insecure default configurations in core-site.xml and hdfs-site.xml",
            "Weak or no authentication setup allowing unauthorized access",
            "Lack of encryption for HDFS data at rest",
            "Insecure communication between Hadoop components (no SSL/TLS)",
            "Open and unprotected YARN ResourceManager and NodeManager web interfaces",
            "Improper network segmentation and insufficient firewall rules",
            "Inadequate logging and monitoring configurations",
            "Default permissions on Hadoop directories and files",
            "Data nodes incorrectly exposed to public networks",
            "Insecure Hadoop WebHDFS setup with default configurations",
            "Insufficient resource management leading to Denial of Service (DoS) vulnerabilities",
            "Misconfigured Kerberos authentication (e.g., principal keytabs improperly secured)"
        ],
        "Apache Spark": [
            "Default security settings are not configured, leading to potential unauthorized access.",
            "Not enabling authentication for the web UI, exposing administrative interfaces to unauthorized users.",
            "Improperly configured access controls, allowing non-administrative users to access sensitive data or perform operations.",
            "Lack of encryption for data in transit, making it susceptible to interception.",
            "Insufficient logging and monitoring, hindering the ability to detect and respond to security incidents.",
            "Running Spark with excessive privileges, increasing the impact of a potential exploitation."
        ],
        "Apache Storm": [
            "Lack of authentication and authorization mechanisms",
            "Insecure communication (no TLS/SSL)",
            "Improperly configured Zookeeper nodes",
            "Default or weak passwords",
            "Exposed management UI",
            "Insufficient logging and monitoring",
            "Improper resource allocation",
            "Insecure deployment settings",
            "Using default ports",
            "Insufficient access controls for Nimbus"
        ],
        "Grafana": [
            "Default admin password not changed",
            "Admin user exposed to the internet",
            "No data source authentication",
            "Disabled HTTPS for web interface",
            "Not configuring proper access control for dashboards",
            "Lack of logging and monitoring",
            "Failure to set up role-based access control (RBAC)",
            "Outdated Grafana instance running with known vulnerabilities",
            "Insecure or missing configuration for plugins",
            "Improper handling of secrets and sensitive information"
        ]
    },
    "Web Servers": {
        "Apache Tomcat": [
            "Default administrative accounts not disabled or removed",
            "Outdated or vulnerable versions being utilized",
            "Insecure default configurations and examples left enabled",
            "Lack of proper access controls for sensitive files and directories",
            "Unencrypted communication channels (HTTP instead of HTTPS)",
            "Verbose error messages that reveal sensitive information",
            "Weak session management configurations",
            "Improper or lack of logging and monitoring for security events",
            "Using default or weak credentials for manager and host-manager applications",
            "Absence of security headers (e.g., X-Frame-Options, X-Content-Type-Options)"
        ],
        "NGINX": [
            "Running as root user",
            "Using default configuration settings",
            "No rate limiting",
            "Insufficient logging and monitoring",
            "Using older, vulnerable versions",
            "Improper handling of HTTP headers",
            "Not configuring SSL/TLS properly",
            "Allowing directory listing",
            "Insufficient input validation",
            "Not using a web application firewall (WAF)"
        ]
    },
    "Databases": {
        "Redis": [
            "No password authentication: Redis can be configured without requiring a password, which leaves it vulnerable to unauthorized access if exposed to the internet.",
            "Binding to all interfaces: By default, Redis binds to all network interfaces, which can inadvertently expose it to external networks if not properly firewalled.",
            "Disabled protected mode: Redis's protected mode is meant to prevent unauthenticated access by default. Disabling this mode increases the risk of unauthorized access.",
            "No encryption for data in transit: Redis does not use encryption for data transmission by default, making the data vulnerable to interception during transit.",
            "Lack of logging and monitoring: Without proper logging and monitoring, it becomes difficult to detect and respond to unauthorized access and other security events.",
            "Insecure default configuration: Redis comes with a very permissive default configuration, which is not suitable for production environments without significant hardening."
        ],
        "PostgreSQL": [
            "Default 'postgres' user retained and accessible",
            "Weak password policies or no password set",
            "Remote access allowed to all IPs (listen_addresses configuration set to '*')",
            "Trust authentication method used allowing login without password",
            "Unrestricted access to database functions or stored procedures",
            "Lack of SSL/TLS encryption for data in transit",
            "Idle sessions not being closed automatically",
            "Lack of regular backups and disaster recovery plans",
            "Logging not adequately configured to detect anomalies and potential attacks",
            "Non-compliance with the principle of least privilege by granting excessively broad permissions to roles",
            "Missing updates and security patches"
        ],
        "ClickHouse": [
            "No password authentication for the default user",
            "Running ClickHouse with elevated privileges (e.g., root)",
            "Improperly configured network security groups allowing access from untrusted networks",
            "Absence of encrypted connections (no TLS configured)",
            "Exposing internal metrics endpoint without access control",
            "Missing or insufficient logging and monitoring setup",
            "Failure to regularly update and patch ClickHouse versions",
            "Insecure or inappropriate use of user roles and permissions",
            "Open HTTP interface without proper authentication",
            "Storing sensitive data without encryption at rest"
        ]
    }
}